<?php
/**
 * 图片斟本配置
 */

//所属网站

//大分类
$dic_img['big_type'] = array(
    1=>"图片",
    2=>"矢量图",
    3=>"PSD",
    4=>"PPT模板",
);
//小分类
$dic_img['small_type'] = array(
    1=>"自然风景",
    2=>"旅行交通",
    3=>"美食餐饮",
    4=>"城市风光",
    5=>"名胜古迹",
    6=>"人物/人像",
    7=>"动物/生物",
    8=>"静物/物品",
    9=>"酒店民宿",
    10=>"古镇/民俗",
    11=>"体育运动",
    12=>"娱乐休闲",
    13=>"天气气象",
    14=>"国旗/地图",
    15=>"其他",
    16=>"雕塑雕像",
    17=>"植物花卉",
    18=>"人文建筑",
    19=>"主题乐园",
    20=>"博物馆/场馆",
);
//图片尺寸 对应
$dic_img['size_type'] = array(
    1=>"特大尺寸",
    2=>"大尺寸",
    3=>"中尺寸",
    4=>"小尺寸",
);
//图片尺寸对应的规则
$dic_img['size_type_map'] = array(
    1=>array("width"=>3000,'maxwidth'=>2999),
    2=>array("width"=>2000,'maxwidth'=>2999),
    3=>array("width"=>1000,"height"=>1999),
    4=>array("width"=>600,"height"=>999),
);

//图片格式
$dic_img['ext'] = array(
    'jpg' => "JPG",
    'gif' => "GIF",
    'tiff' => "TIFF",
    'png' => "PNG",
);


//审核态态
$dic_img['audit_state'] = array(
    0=>"待提交",
    1=>"待审核",
    2=>"审核通过",
    3=>"审核驳回",
);

//排序方式
$dic_img['sort_by'] = [
    0 => "默认排序",
    1 => "审核时间",
    2 => "下载量",
    3 => "收藏量",
];
/**
 * 图片用途
 */
$dic_img['purpose'] = array(
//    1=>"不限",
    2=>"可商业用途",
    3=>"仅编辑用途",
);

/**
 * 一、图片瀑布流
宽：280 px
高：适应于图片本身尺寸
二、图片详情页
500 px * 500 px
三、查看大图比例
宽：800 px
四、上传图片单个
500 px * 500 px
 */

/*
 * 搜索时间
 */
$dic_img['time_list'] = [
    1 => '一周内',
    2 => '一个月内',
    3 => '三个月内',
    4 => '半年内',
    5 => '一年内',
];

//审核驳回问题
$dic_img['reject_reason'] = [
    1 => '图片标题问题',
    2 => '图片分类有误',
    3 => '拍摄地点信息不清晰',
    4 => '图片关键词问题',
    5 => '图片质量问题',
    6 => '图片含敏感/违规元素',
    7 => '其他',
    8 => '图片残缺无法读取信息',//格式有误，读取失败，无法生成logo图
];